{"0": {"author": "raghavv", "date": "1632402476198", "content": "Dear All,\nI am a fresher to the field of quantum computing and I am going through VQE. I have a fundamental question regarding VQE.\nFrom classical computational chemistry point of view, does the VQE find the global minimum for the given molecular input by doing what is called GEOMETRY OPTIMIZATION or simply does the SINGLE POINT CALCULATION for the given molecular geoemetry.\nThank you\n\n\n Solved by mlxd in post #2 \n\n\n                Hi @raghavv, and welcome to the forum! \nUsually with VQE, single point calculations are the normal route, however, it is possible to use VQE for geometry optimzation. \nWhen calculating a single VQE instance energy, one usually chooses a fixed geometry starting point for the molecule to generate a gi…\n              \n1", "link": "https://discuss.pennylane.ai//t/vqe-variational-quantum-eigensolver/1377/1"}, "1": {"author": "mlxd", "date": "1632420659948", "content": "Hi @raghavv, and welcome to the forum!\nUsually with VQE, single point calculations are the normal route, however, it is possible to use VQE for geometry optimzation.\nWhen calculating a single VQE instance energy, one usually chooses a fixed geometry starting point for the molecule to generate a given Hamiltonian.\nAn optimization step is then performed over a set of parameters used to prepare a quantum state which is then used to calculate the energy for the Hamiltonian.\nAs an example, we can calculate the energy using:\nE = \\langle\\Psi(\\theta)|H|\\Psi(\\theta)\\rangle = \\langle 0 | U^{\\dagger}_{\\theta} H U_{\\theta} | 0 \\rangle\nBy optimizing over the parameters \\theta we can find the quantum state |\\Psi(\\theta)\\rangle that minimizes the energy of the Hamiltonian for our fixed geometry, and from the above expectation value calculation, the resulting numerical value.\nIf you wanted to find the optimal geometry configuration, we can calculate more energies with different geometries, giving us a new Hamiltonian for each.\nIt is then possible to use the differences in these energies in an outer optimization stage to find the optimal positions for a molecule.\nIt can also be noted that you are free to optimize over any parameter you’d like.\nI hope this helped!Solution3", "link": "https://discuss.pennylane.ai//t/vqe-variational-quantum-eigensolver/1377/2"}, "2": {"author": "raghavv", "date": "1632664537083", "content": "@mlxd. Thank you sir for detailed response. Is there any way we can do geometry optimization using VQE and get the cartesian coordinate of the optimized geometry using Pennylane. Thank you", "link": "https://discuss.pennylane.ai//t/vqe-variational-quantum-eigensolver/1377/3"}, "3": {"author": "mlxd", "date": "1632729525844", "content": "Hi @raghavv, glad to help. Here is a tutorial 31 on performing geometry optimization with PennyLane for the trihydrogen cation (H3+). This should be a good starting place to try with other molecules too.1", "link": "https://discuss.pennylane.ai//t/vqe-variational-quantum-eigensolver/1377/4"}, "4": {"author": "raghavv", "date": "1632798520696", "content": "Thank you so much @mlxd . Wil take into look into it.1", "link": "https://discuss.pennylane.ai//t/vqe-variational-quantum-eigensolver/1377/5"}, "5": {"author": "CatalinaAlbornoz", "date": "1632851490935", "content": "Let us know how it goes @raghavv!", "link": "https://discuss.pennylane.ai//t/vqe-variational-quantum-eigensolver/1377/6"}, "6": {"author": "raghavv", "date": "1633783995090", "content": "Sure.! Thank you @CatalinaAlbornoz", "link": "https://discuss.pennylane.ai//t/vqe-variational-quantum-eigensolver/1377/7"}, "7": {"author": "paul", "date": "1634776703241", "content": "@raghavv - were you able to make progress in generalizing from the tutorial to other molecules. I’m (very) new to quantum chemistry myself. I wonder if there is a straightforward way to apply this approach to H2O or other more complex molecules. I’d be very interested to hear your experience", "link": "https://discuss.pennylane.ai//t/vqe-variational-quantum-eigensolver/1377/8"}, "8": {"author": "sjahangiri", "date": "1634850910802", "content": "Hi @paul and welcome to the forum!\nIt is easy and straightforward to apply the geometry optimisation algorithm outlined in this tutorial 2 for the trihydrogen cation, as a case study, to other molecules.\nThere are basically two parts of the workflow that need to be updated. The first part includes the molecular properties such as atomic symbols and coordinates and the second part is the circuit. For a molecule such as LiH, as an example, you can replace the trihydrogen cation information with:\nsymbols = [\"Li\", \"H\"]\ngeometry = np.array([0.0, 0.0, 0.0, 0.0, 0.0, 2.969280527])   \n\nand the circuit might be built adaptively following this tutorial 8. Then you can follow the procedure in the geometry optimisation tutorial to optimise the geometry of LiH.\nWe have used the same procedure to optimise the geometry of H2, H3 cation, BeH2 and H2O  and the results are discussed in this paper 8.\nPlease feel free to let us know if you have any questions.3 Replies", "link": "https://discuss.pennylane.ai//t/vqe-variational-quantum-eigensolver/1377/9"}, "9": {"author": "paul", "date": "1634867987602", "content": "Thanks so much. I’m trying to help my high-school aged son with a quantum chemistry project. It’s a steep learning curve for me also, and your guidance here is very helpful!", "link": "https://discuss.pennylane.ai//t/vqe-variational-quantum-eigensolver/1377/10"}, "10": {"author": "paul", "date": "1635101192031", "content": "Thanks again for the links to the tutorials. Is the CCCBDB 3 a good source for initial geometry data for input into the adaptive circuit procedure? And is there a similar source of information for the number of active orbitals? Thanks!", "link": "https://discuss.pennylane.ai//t/vqe-variational-quantum-eigensolver/1377/11"}, "11": {"author": "raghavv", "date": "1635128814898", "content": "@paul . I have not really tried the code optimizing other molecules (apart from H3+), however I think @sjahangiri has shared the appropriate material for such an effort.  In case you are looking for geometry, (source other than CCCBDB, to build new molecules of your choice), you can use a couple of open source molecule builders such as Avogadro(https://avogadro.cc/ 1) or IQmol (http://iqmol.org/). These can be really handy. Hope this helps.1", "link": "https://discuss.pennylane.ai//t/vqe-variational-quantum-eigensolver/1377/12"}, "12": {"author": "paul", "date": "1638127088251", "content": "Hi @sjahangiri, I’ve built the LiH circuit following the adaptive circuit tutorial, but I’m running into a Wire error in the theta optimization step of the molecular optimization code. There are 10 wires (5 active orbitals), but I’m getting “Wire with label 10 not found in <Wires = [0, 1, 2, 3, 4, 5, 6, 7, 8, 9]>”. I’d appreciate any suggestions on what I might be missing. Thanks", "link": "https://discuss.pennylane.ai//t/vqe-variational-quantum-eigensolver/1377/13"}, "13": {"author": "CatalinaAlbornoz", "date": "1638203736195", "content": "Hi @paul.\nIt looks like somewhere you’re calling “wires=10”. However the last wire is “wires=9” since indexing starts at 0.\nIf this is not the case then could you share your code so that we can take a look?\nI hope this helps!", "link": "https://discuss.pennylane.ai//t/vqe-variational-quantum-eigensolver/1377/14"}, "14": {"author": "paul", "date": "1638236250354", "content": "Hi @CatalinaAlbornoz,\nHere’s the code in github 2. I’m encountering the error in cell 34. The number of wires is set in cell 27 to be equal to the number of qubits (in this case 10). I’ve just replicated the code from the optimization of molecular geometry tutorial 2, which used 6 qubits. Again, I’m sure that I’m made a very simple error somewhere (I’m only an amateur programmer!). Thanks very much for taking a look!", "link": "https://discuss.pennylane.ai//t/vqe-variational-quantum-eigensolver/1377/15"}, "15": {"author": "CatalinaAlbornoz", "date": "1638311464809", "content": "Hi @paul, I was able to reproduce your error and I must say it’s puzzling me too.\n@josh, Do you have any idea of why this is happening? I was able to reproduce it by changing the symbols, the geometry and the charge with respect to the demo, which works well.", "link": "https://discuss.pennylane.ai//t/vqe-variational-quantum-eigensolver/1377/16"}, "16": {"author": "josh", "date": "1638352392937", "content": "Hi @paul!\nThe issue arises because, when you redefine the Hamiltonian for the molecular geometry optimization,\ndef H(x):\n    return qml.qchem.molecular_hamiltonian(symbols, x, charge=0)[0]\n\n\nyou are not passing the number of active electrons and orbitals as you were earlier, when determining the number of qubits needed!\nWithout passing these values, the computed Hamiltonian will require 12 qubits.\nInstead, if we modify the Hamiltonian definition to include these restrictions, we will now get a Hamiltonian with 10 qubits as expected:\ndef H(x):\n    return qml.qchem.molecular_hamiltonian(symbols, x, charge=0, active_electrons=2, active_orbitals=5)[0]\n", "link": "https://discuss.pennylane.ai//t/vqe-variational-quantum-eigensolver/1377/17"}, "17": {"author": "paul", "date": "1638372215280", "content": "Thanks very much @josh and @CatalinaAlbornoz - that fixed it!", "link": "https://discuss.pennylane.ai//t/vqe-variational-quantum-eigensolver/1377/18"}}