{"0": {"author": "sophchoe", "date": "1632352647532", "content": "I see that the concept of cutoff dimension, which is absent in superconducting quantum computing model, adds much more flexibility for interesting computation.\nIs there a documentation I can read to understand the concept?\nThanks.", "link": "https://discuss.pennylane.ai//t/cutoff-dimension/1372/1"}, "1": {"author": "Tom_Bromley", "date": "1632395793631", "content": "Hey @sophchoe!\nA great resource to check out is the theory 8 pages of the Strawberry Fields documentation. The introduction to quantum photonics section should be useful to get an understanding of the cutoff dimension, which relates to the maximum number of photons being simulated. This 5 review article from a few years back may also help introduce some of the language we use in photonic quantum computing.\nThanks,\nTom", "link": "https://discuss.pennylane.ai//t/cutoff-dimension/1372/2"}, "2": {"author": "sophchoe", "date": "1632430874233", "content": "Thank you, Tom!\nMy understanding from “Gaussian Quantum Information” is that any thermal state can be represented by an infinite linear combination of the number base density matrices in an infinite-dimensional Hilbert space. Am I correct in assuming the cutoff dimension would be the number of number bases that we select of that infinite representation?\nIn physical implementation, the difference between the qubit system and the photonic system, it seems to me, is\n\nEach qubit is realized with one electron\nEach q-mode is realized with multiple photons.\n\nIs this a correct understanding?\nThank you.", "link": "https://discuss.pennylane.ai//t/cutoff-dimension/1372/3"}, "3": {"author": "Tom_Bromley", "date": "1632432763503", "content": "Hi @sophchoe.\nYes, as well as the thermal state in Eq. (27) of  Gaussian Quantum Information 2, you can see the expansion of other common photonic states into the number/Fock basis. For example, coherent states in Eq. (29) and squeezed states in Eq. (33). Although these states are expanded in an infinite-dimensional basis, you can see the coefficients for each Fock state |n\\rangle decrease exponentially with n, so that we can introduce an effective cutoff n_{\\rm cutoff} and only consider expanding up to n \\leq n_{\\rm cutoff}.\n\nIn physical implementation, the difference between the qubit system and the photonic system, it seems to me, is\n\nEach qubit is realized with one electron\nEach q-mode is realized with multiple photons.\n\n\nRight, one nice way to imagine a qumode is simply as a waveguide along a chip (and is indeed how we implement them on our hardware 4). Waveguides can be interacted individually or together, and can contain multiple photons in each laser pulse. We then measure how many photons come out from the chip.", "link": "https://discuss.pennylane.ai//t/cutoff-dimension/1372/4"}, "4": {"author": "sophchoe", "date": "1632441217199", "content": "Haha, good enough approximation. Get it! it’s like\n\n\nApproximating a function with a Taylor expansion (if we can tolerate the error, we don’t need an infinite sum) or\n\n\nPrincipal component analysis\n\n\nSVD.\n\n\nAs for the photonic model, I say “Neat! Pretty neat!” Can I view a qumode as a communication channel? This to me is a better implementation of the statistical nature of quantum mechanics than the one-to-one qubit model.\nI just read your hardware page. Intriguing! Truly intriguing! From the paper, they talk about manipulating electromagnetic field for computation. Is there a snippet page on how you do that?\nThank you so much, Tom!", "link": "https://discuss.pennylane.ai//t/cutoff-dimension/1372/5"}, "5": {"author": "Tom_Bromley", "date": "1632485554441", "content": "Hi @sophchoe,\n\nCan I view a qumode as a communication channel?\n\nI’d interpret light running along the waveguide, and potentially interacting with the environment (e.g., during bends in the waveguide), as a channel.\n\nFrom the paper, they talk about manipulating electromagnetic field for computation. Is there a snippet page on how you do that?\n\nI’m not sure if you’re referring to this 2 paper, but I’d recommend checking it out if you haven’t seen it. Our hardware 2 papers are another good resource.", "link": "https://discuss.pennylane.ai//t/cutoff-dimension/1372/6"}, "6": {"author": "sophchoe", "date": "1632763767413", "content": "Hi Tom,\nCurrently, how many photons do you use per qumode?\nIn the qubit model, they have to run multiple shots to get the probability of their measurement result.\nIn your model, theoretically one shot suffices since that statistical process is built in by having multiple photons in a qumode?", "link": "https://discuss.pennylane.ai//t/cutoff-dimension/1372/7"}, "7": {"author": "Tom_Bromley", "date": "1632830648625", "content": "Hi @sophchoe!\n\nCurrently, how many photons do you use per qumode?\n\nOn simulators, the cutoff dimension is a free parameter. It should be large enough so that we are still keeping track of a significant proportion of amplitudes in the Fock basis. This choice depends on the circuit: the presence of squeezers, displacers and other particle generating gates can alter the mean photon number in the circuit. We can hence aim to find the mean photon number at the output of the circuit and adjust the cutoff accordingly.\nOn hardware, we don’t have a cutoff dimension and there is more freedom on the number of photons. However, there may be some limitation on the detector side: if a single detector is hit by 10+ photons then resolution becomes harder.\n\nIn the qubit model, they have to run multiple shots to get the probability of their measurement result.\nIn your model, theoretically one shot suffices since that statistical process is built in by having multiple photons in a qumode?\n\nIn the photonic model, one also has to perform multiple shots to recover the probability of measuring a given pattern of photons. You can see what the output of sampling from a photonic device looks like here 2. The main difference between qubit and photonic models in this regard is simply that the qubit approach samples from a discrete binary distribution and the photonic approach samples from a discrete distribution over the set of natural numbers.", "link": "https://discuss.pennylane.ai//t/cutoff-dimension/1372/8"}, "8": {"author": "sophchoe", "date": "1632934694151", "content": "Thank you, Tom!\n“Quantum circuits with many photons on a programmable nanophotonic chip” is a huge help in understanding. https://arxiv.org/pdf/2103.02109.pdf 2\nIn the following diagram, could you explain the fixed U(2) transformation part? The rest is very clear from the paper.\n\n48%20AM1272×908 45.6 KB\n\nThank you.", "link": "https://discuss.pennylane.ai//t/cutoff-dimension/1372/9"}, "9": {"author": "Tom_Bromley", "date": "1632946621567", "content": "Hi @sophchoe,\nThe U(2) transformation denotes a fixed 50:50 beamsplitter. When equal squeezing on two modes is combined with such a beamsplitter, the result is known as two-mode squeezing 2.\nThe reason we have two-mode squeezing is due to hardware considerations - we have four physical waveguides that each contain two-mode squeezed states (e.g., mode 0 and 4 in the diagram above are one physical mode).", "link": "https://discuss.pennylane.ai//t/cutoff-dimension/1372/10"}, "10": {"author": "sophchoe", "date": "1632947703880", "content": "I thought beam splitters and phase shifters were included in the U4 transformation. Then would U4 include phase shifters, displacement gates, and Kerr gates instead?", "link": "https://discuss.pennylane.ai//t/cutoff-dimension/1372/11"}, "11": {"author": "Tom_Bromley", "date": "1632951443756", "content": "The U4 in the diagram above is physically composed of controllable Mach-Zehnder interferometers and rotation gates, as you can see in the compilation discussion here 4.\nBeing programmable, the array of MZ-interferometers and rotations can realize an arbitrary 4-mode interferometer. Such a transformation does not include displacement and Kerr gates.\nWe separate out the 50:50 beamsplitters of the two-mode squeezing from the rest of the interferometer section out of simplicity, since those beamsplitters are fixed and would also couple the two U4 interferometers.", "link": "https://discuss.pennylane.ai//t/cutoff-dimension/1372/12"}, "12": {"author": "sophchoe", "date": "1633388175958", "content": "Hi Tom,\nIs your standard mode of measurement Homodyne detection? Would it be safe to think that’s the way of counting the number of photons per qumode?", "link": "https://discuss.pennylane.ai//t/cutoff-dimension/1372/13"}, "13": {"author": "Tom_Bromley", "date": "1633434332876", "content": "Hi @sophchoe,\nIn general some standard measurement types are:\n\nHomodyne (measuring in position or momentum basis)\nPhoton number counting (project into Fock basis)\nHeterodyne (project onto a coherent state)\n\nFor our X8 chip, we use PNR (photon number resolving) detectors to count the number of photons coming out of each mode.", "link": "https://discuss.pennylane.ai//t/cutoff-dimension/1372/14"}, "14": {"author": "sophchoe", "date": "1633452043564", "content": "Thank you for the clarification! Greatly helpful!\nCurrently, is X8 for up to 8 qumodes?", "link": "https://discuss.pennylane.ai//t/cutoff-dimension/1372/15"}, "15": {"author": "Tom_Bromley", "date": "1633466609856", "content": "No problem!\nYes, X8 an 8 mode device with a fixed circuit structure (see here). The 8 modes are generated through 4 physical waveguides. Each waveguide contains a pair of modes that can be thought of as being squeezed by the same amount and then passed through a 50:50 beamsplitter.\nIn practice, you don’t have to use all of the 8 modes.2 Replies", "link": "https://discuss.pennylane.ai//t/cutoff-dimension/1372/16"}, "16": {"author": "sophchoe", "date": "1633466763784", "content": "Yes, I see that. Just 2-mode computations are creating excellent results.\nThank you for all your feedback!1", "link": "https://discuss.pennylane.ai//t/cutoff-dimension/1372/17"}, "17": {"author": "sophchoe", "date": "1633467722268", "content": "Is it a correct understanding that\n“Measurement (projection of each qumode result to Fock basis) is being performed per qumode. That means each qumode is represented in its own Fock space.”?", "link": "https://discuss.pennylane.ai//t/cutoff-dimension/1372/18"}, "18": {"author": "Tom_Bromley", "date": "1633471195443", "content": "Yes, we do photon number counting with the X8 chip, which projects each qumode onto a Fock state (corresponding to the number of photons counted in the detector).\nBefore a qumode gets measured and projected into the Fock basis, one can in principle describe the qumode in any basis. For example, a squeezed state is a superposition over position eigenstates (though it could also be expanded in another basis). When the squeezed state hits the photon number detectors, we project into the Fock basis.1 Reply", "link": "https://discuss.pennylane.ai//t/cutoff-dimension/1372/19"}, "19": {"author": "sophchoe", "date": "1633474940183", "content": "would it be\n\nbefore the measurement, the state of each qumode is represented by an infinite sum of different number basis states (approximated by the defined cutoff dimension)\nafter the measurement, you observe the superposition of each qumode collapsing into one of the number basis state?\n", "link": "https://discuss.pennylane.ai//t/cutoff-dimension/1372/20"}, "20": {"author": "Tom_Bromley", "date": "1633521269936", "content": "Yes @sophchoe, that sounds right!", "link": "https://discuss.pennylane.ai//t/cutoff-dimension/1372/21"}, "21": {"author": "sophchoe", "date": "1633621871533", "content": "In this picture,\n\n|613px;x335px;2048×1121 355 KB\n\nis Gaussian Boson sampling performed much faster on X8 than on classical computers, or the fact it is done on X8 of importance?", "link": "https://discuss.pennylane.ai//t/cutoff-dimension/1372/22"}, "22": {"author": "Ant_Hayes", "date": "1633631845518", "content": "Hi @sophchoe,\nSince classical computers are extremely advanced in their development compared to quantum hardware they are generally capable of solving the same sampling problems at comparable speeds however the aim is indeed to find problems well suited to GBS and use devices like X8 to demonstrate and advantage. Section IV of this paper 2 details several problems that GBS is well suited to solving.", "link": "https://discuss.pennylane.ai//t/cutoff-dimension/1372/23"}, "23": {"author": "sophchoe", "date": "1633639892882", "content": "Thank you so much @Ant_Hayes. The paper was very helpful.\nOne more concept I want clarification on: observables\nWould it be correct or incorrect to say\n\nQubit based observables are amplitude and phase of an electron\nQumode based observables are position and momentum of a photon?\n", "link": "https://discuss.pennylane.ai//t/cutoff-dimension/1372/24"}, "24": {"author": "Ant_Hayes", "date": "1633645454013", "content": "Hi @sophchoe,\nThis is a very fundamental question! Arguably, all we can ever measure of any physical system is position and momentum.\nAmplitude and phase of a qubit observable will determine the probability the qubit’s observable of interest being in a given state. Often these measurement are realised through counting particles. This is also true of qumode (photons).\nThinking back to Young’s double slit experiment is a great example of quantum measurements. Again, this is simply counting particles that appear at certain positions!", "link": "https://discuss.pennylane.ai//t/cutoff-dimension/1372/25"}, "25": {"author": "sophchoe", "date": "1633647574893", "content": "Just to clarify my understanding when I see the term “Observable” on Pennylane documentation. What would be the best way to interpret that? The photon count?1 Reply", "link": "https://discuss.pennylane.ai//t/cutoff-dimension/1372/26"}, "26": {"author": "sophchoe", "date": "1633704651123", "content": "@Tom_Bromley Can we access the state vector before measurement of a circuit only on simulators or on X8 as well? I can understand the final quantum state of the circuit before measurement being represented mathematically on a simulator. Do we have the same kind of access on a QPU without measurement?1 Reply", "link": "https://discuss.pennylane.ai//t/cutoff-dimension/1372/27"}, "27": {"author": "Ant_Hayes", "date": "1633709402526", "content": "Hi @sophchoe,\nObservables in PennyLane can be thought of a matrices which act on quantum state vectors to give eigenvalues which tell us the state of the system. These matrices have a special property of being Hermitian which guarantees the eigenvalues they return are real numbers.", "link": "https://discuss.pennylane.ai//t/cutoff-dimension/1372/28"}, "28": {"author": "Ant_Hayes", "date": "1633709944514", "content": "Hi @sophchoe,\nIn general it is not possible to access information on a quantum state without performing a projective measurement which inherently changes the state of the system. This is know as wave function collapse.\nThere are active areas of research on accessing states without collapsing the wave function for example see weak measurements but this is not yet a practical option for quantum computation.", "link": "https://discuss.pennylane.ai//t/cutoff-dimension/1372/29"}, "29": {"author": "sophchoe", "date": "1633721039505", "content": "Hi @Ant_Hayes,\nIn Strawberry Fields, you have an option of extracting state vectors. Is it an accurate understanding that it is possible only on a simulator, not on an X8 chip?", "link": "https://discuss.pennylane.ai//t/cutoff-dimension/1372/30"}, "30": {"author": "Ant_Hayes", "date": "1633722508478", "content": "Hi @sophchoe,\nYes that’s accurate since the X8 chip is a quantum device. We can only build up information on the quantum state through many repeated measurements.", "link": "https://discuss.pennylane.ai//t/cutoff-dimension/1372/31"}, "31": {"author": "sophchoe", "date": "1633724955679", "content": "@Ant_Hayes,\nGreat! Thank you!\nFor each qumode, the pre-measurement state is an infinite sum of Fock basis, approximated by the number of basis defined by the cutoff dimension.\nIn multi-qumodes, it is a tensor product space of those Fock spaces?", "link": "https://discuss.pennylane.ai//t/cutoff-dimension/1372/32"}, "32": {"author": "Ant_Hayes", "date": "1633728340215", "content": "Hi @sophchoe,\nYes, the state of the full system can be described by the tensor product of the individual modes in a given basis such as the Fock basis.", "link": "https://discuss.pennylane.ai//t/cutoff-dimension/1372/33"}, "33": {"author": "sophchoe", "date": "1637181713606", "content": "Hi @Ant_Hayes,\nThe Kerr gate is represented by \nDo you have a matrix representation of this? How do we derive a hat?", "link": "https://discuss.pennylane.ai//t/cutoff-dimension/1372/34"}, "34": {"author": "Maria_Schuld", "date": "1637219973493", "content": "Hey @sophchoe,\nremember that the number operator in Fock basis is a diagonal matrix diag(0, 1, 2, 3, ...), which means that n^2 = diag(0, 1, 4, 9, ...). Since exponentiating a diagonal matrix is the same as a matrix with exponentials of the diagonal elements, we get\nexp(i k n^2) = diag(1, e^ik, e^4ik, ...) \nHope this helps!\nPS: For cases that are not as simple you may try to consult the StrawberryFields source code 2.", "link": "https://discuss.pennylane.ai//t/cutoff-dimension/1372/35"}, "35": {"author": "sophchoe", "date": "1637377509480", "content": "Great! Thank you so much.", "link": "https://discuss.pennylane.ai//t/cutoff-dimension/1372/36"}}