{"0": {"author": "Cc1", "date": "1684917818729", "content": "I am reading the paper Quantum embeddings for machine learning. I remember that the previous demo of Pennylane contained the code of this article, but recently opened it and found that it is gone. Is it officially deleted?\n\n\n Solved by Maria_Schuld in post #10 \n\n\n                Hey @Cc1! \nI have some bad (yet interesting) news. I spent quite a bit of time to try and fix the metric learning demo, and consistent with my previous attempts I just cannot get around the issue of overfitting without changing the architecture considerably, even after all problems with the data see…\n              \n", "link": "https://discuss.pennylane.ai//t/did-pennylane-delete-the-demo-of-quantum-metric-learning/2972/1"}, "1": {"author": "isaacdevlugt", "date": "1684939584892", "content": "Hey @Cc1! Yep, this demo was deleted.", "link": "https://discuss.pennylane.ai//t/did-pennylane-delete-the-demo-of-quantum-metric-learning/2972/2"}, "2": {"author": "Cc1", "date": "1684975274591", "content": "Thank you very much for your reply, so where else can I find the demo code of quantum metric learning? Thanks.", "link": "https://discuss.pennylane.ai//t/did-pennylane-delete-the-demo-of-quantum-metric-learning/2972/3"}, "3": {"author": "isaacdevlugt", "date": "1685029949677", "content": "The demo isn’t available anywhere to my knowledge.", "link": "https://discuss.pennylane.ai//t/did-pennylane-delete-the-demo-of-quantum-metric-learning/2972/4"}, "4": {"author": "isaacdevlugt", "date": "1685043119644", "content": "Let me see if I can figure out why @Cc1!", "link": "https://discuss.pennylane.ai//t/did-pennylane-delete-the-demo-of-quantum-metric-learning/2972/5"}, "5": {"author": "Cc1", "date": "1685062075069", "content": "Thank you very much for your help!1", "link": "https://discuss.pennylane.ai//t/did-pennylane-delete-the-demo-of-quantum-metric-learning/2972/6"}, "6": {"author": "Maria_Schuld", "date": "1685342096940", "content": "Hey @Cc1!\nThis is entirely my fault, I realised that the demo contained a bug (I accidentally used training data for testing, uuuh!). Once fixed, the model we showcased, adding a small quantum feature map to a big classical model, hopelessly overfitted. I simply did not have the time to look into this, and it seemed to be a deeper problem that needs some more research.\nSince there are still requests for that demo I will have another look at the problem in the next 1-2 months and let you know in this thread if we can upload it again.\nHope that helps!\nMaria1", "link": "https://discuss.pennylane.ai//t/did-pennylane-delete-the-demo-of-quantum-metric-learning/2972/7"}, "7": {"author": "Cc1", "date": "1685342949155", "content": "Thank you very much for your help. Many of your academic papers have been very inspiring to me.1", "link": "https://discuss.pennylane.ai//t/did-pennylane-delete-the-demo-of-quantum-metric-learning/2972/8"}, "8": {"author": "Maria_Schuld", "date": "1685345909696", "content": "That’s too kind, thanks ", "link": "https://discuss.pennylane.ai//t/did-pennylane-delete-the-demo-of-quantum-metric-learning/2972/9"}, "9": {"author": "Maria_Schuld", "date": "1691663392808", "content": "Hey @Cc1!\nI have some bad (yet interesting) news. I spent quite a bit of time to try and fix the metric learning demo, and consistent with my previous attempts I just cannot get around the issue of overfitting without changing the architecture considerably, even after all problems with the data seem fixed.\nI went back to the original code from the paper’s simulations and found that this wasn’t picked up because we had the same bug in the datasets - the test set was accidentally a copy of the training set (uuh, I know!). The observation from the paper is still valid for the training set: the classifier learns to arrange the data on a periodic grid to suit the periodic nature of the embedding into Pauli gates, which is somehow cool.\nIn the end I have to conclude that metric learning in this setting just does not work. It is a very different cost objective from the usual l2-loss, and the literature mentions problems with overfitting (i.e. here). This might be even worse in the case of the demo where we are trying to learn from ~150 examples using well over 1000 parameters.\nIn short, I will close the PR 1 and we won’t re-add the demo. (While a negative example of something not working would be great to showcase that QML research is not as easy as people suggest it to be, I think it could confuse early-stage users who try to copy the bad practice.)\nIf you want to try and play with the code a bit, you can just download or copy the file tutorial_embeddings_metric_learning.py. It is written in rst format and there are ways to convert into a jupyter notebook.\nHope this all helps - it is a nice example of how research does not always give us the results we want \nMariaSolution3", "link": "https://discuss.pennylane.ai//t/did-pennylane-delete-the-demo-of-quantum-metric-learning/2972/10"}, "10": {"author": "Cc1", "date": "1691718924271", "content": "Thank you for the detailed update on your work exploring quantum metric learning. I appreciate you taking the time to thoroughly investigate this method and identify the challenges with overfitting on more complex datasets.\nWhile disappointing that quantum metric learning did not live up to its initial promise on the dataset from the paper, I think this is an important finding. As you mentioned, negative results are just as crucial to document as positive ones on the path to developing reliable quantum machine learning techniques.\nIt is worth noting that although the quantum metric learning approach faces difficulties with overfitting in the paper’s hybrid quantum-classical embeddings, it has shown promising results on relatively simple datasets in my experiments.  In addition, I found that the experimental results were slightly improved after using a more complex ResNet to extract features.\nThank you again for your persistence and for sharing these insights. Research can be frustrating when findings contradict expectations, but uncovering these kinds of issues will ultimately strengthen the field. I appreciate you taking the time to investigate this thoroughly and provide clear documentation for future reference.2", "link": "https://discuss.pennylane.ai//t/did-pennylane-delete-the-demo-of-quantum-metric-learning/2972/11"}, "11": {"author": "Maria_Schuld", "date": "1691994395187", "content": "Pleasure, and I very much agree with you, more honesty on negative results would help research a lot!", "link": "https://discuss.pennylane.ai//t/did-pennylane-delete-the-demo-of-quantum-metric-learning/2972/12"}, "12": {"author": "vinayak19th", "date": "1699930667886", "content": "I’m currently working on a follow-up and was wondering if your team ever tried multiple classes and if so what were your observations?", "link": "https://discuss.pennylane.ai//t/did-pennylane-delete-the-demo-of-quantum-metric-learning/2972/13"}, "13": {"author": "isaacdevlugt", "date": "1700059799694", "content": "Hey @vinayak19th!\nIf I’m understanding your question correctly, there are a lot of studies that demonstrate QML models as multi-class classifiers. Here’s a good example from a demo we have:\n\n\n\npennylane.ai\n\n\n\nMulticlass margin classifier | PennyLane Demos 1\nUsing PyTorch to implement a multiclass quantum variational classifier on MNIST data.\n\n\n\n\n\nTough to say what the general observations are on the whole, but I can say that it’s very possible to train QML models on multi-class data 1", "link": "https://discuss.pennylane.ai//t/did-pennylane-delete-the-demo-of-quantum-metric-learning/2972/14"}, "14": {"author": "isaacdevlugt", "date": "1700059799694", "content": "Hey @vinayak19th!\nIf I’m understanding your question correctly, there are a lot of studies that demonstrate QML models as multi-class classifiers. Here’s a good example from a demo we have:\n\n\n\npennylane.ai\n\n\n\nMulticlass margin classifier | PennyLane Demos 1\nUsing PyTorch to implement a multiclass quantum variational classifier on MNIST data.\n\n\n\n\n\nTough to say what the general observations are on the whole, but I can say that it’s very possible to train QML models on multi-class data 1", "link": "https://discuss.pennylane.ai//t/did-pennylane-delete-the-demo-of-quantum-metric-learning/2972/15"}}