{"0": {"author": "sophchoe", "date": "1656027797456", "content": "I am trying to implement a Ternary Grover’s algorithm circuit using PennyLane.\nWith cutoff dimension 3, can I implement the following matrices on one qumode?\n\n\n24%20PM1032×498 18.7 KB\n", "link": "https://discuss.pennylane.ai//t/implementing-specific-matrices/1995/1"}, "1": {"author": "CatalinaAlbornoz", "date": "1656356047588", "content": "Hi @sophchoe,\nSorry I took so long to respond. I haven’t been able to find an answer to your problem. I will keep looking though.", "link": "https://discuss.pennylane.ai//t/implementing-specific-matrices/1995/2"}, "2": {"author": "sophchoe", "date": "1656357831912", "content": "Thank you @CatalinaAlbornoz!\nI wanted to see how to implement any unitary matrix of size of n x n on a qumode with cutoff dimension n.\nI want to set all qumodes to cutoff dimension 3 and then apply a ternary Hadamard to each. Maybe a 3x3 matrix with all 1/sqrt(3) except for the last two diagonal to be  -1/sqrt(3) would be a better matrix.", "link": "https://discuss.pennylane.ai//t/implementing-specific-matrices/1995/3"}, "3": {"author": "ziofil", "date": "1656359505307", "content": "To clarify, you want to send |2> to -|2> and leave vacuum and |1> as they are?", "link": "https://discuss.pennylane.ai//t/implementing-specific-matrices/1995/4"}, "4": {"author": "sophchoe", "date": "1656360091012", "content": "Hi @ziofil\nMore like  .\nI would like to know the general method of implementing n x n matrix on a qumode of cutoff dimension n.\nOr a controlled gate on 2 qumodes with the use of beamsplitters.\nThank you.", "link": "https://discuss.pennylane.ai//t/implementing-specific-matrices/1995/5"}, "5": {"author": "ziofil", "date": "1656360436176", "content": "You don’t have full freedom to implement any unitary on qumodes, unfortunately. If you use only Gaussian components at most you can implement a Gaussian unitary, and those don’t look like Gaussian unitaries.", "link": "https://discuss.pennylane.ai//t/implementing-specific-matrices/1995/6"}, "6": {"author": "CatalinaAlbornoz", "date": "1656362406018", "content": "Hi @sophchoe,\nAs Filippo mentioned, implementing any arbitrary unitary is not possible. For specific unitaries though you can synthesize them from other gates using ML methods. You can read more about this on this paper 2.\nI hope this helps!\nEdit: Filippo just did a quick check on Mr Mustard and unfortunately for your matrix you would need some non-gaussian gates (kerr gates or cubic phase).", "link": "https://discuss.pennylane.ai//t/implementing-specific-matrices/1995/7"}, "7": {"author": "sophchoe", "date": "1656437252259", "content": "Hi @CatalinaAlbornoz\nMulti-valued logic problems are more related to digital circuit design, a totally different category than machine learning.\nOn a separate note:\nI am running experiments on MNIST using all the available CV gates for data encoding. This allows me to encode more features into quantum and  it seems promising.\nI will let you know.\nThank you so much for all your help!", "link": "https://discuss.pennylane.ai//t/implementing-specific-matrices/1995/8"}, "8": {"author": "CatalinaAlbornoz", "date": "1656512361223", "content": "Thank you for the clarification about the multi-valued logic problems @sophchoe!\nAbout your separate note, have you considered using datasets different to MNIST? It may be interesting to see the performance in other datasets too.", "link": "https://discuss.pennylane.ai//t/implementing-specific-matrices/1995/9"}, "9": {"author": "sophchoe", "date": "1656534195726", "content": "Yes, @CatalinaAlbornoz.\nI’ve tried Breast Cancer Wisconsin (30 features) and it was in the 60% range for accuracy. I think it’s because the feature values are very skewed.\nI am working with MNIST because the feature size is 784, which is very difficult to encode in the qubit model. We would need 784 qubits or 295 qubits. That’s the power of the CV model that it allows for encoding a higher number of features because of the availability of richer array of parameterized gates.\nIf you have any specific dataset in mind, please let me know.\nSophie", "link": "https://discuss.pennylane.ai//t/implementing-specific-matrices/1995/10"}, "10": {"author": "CatalinaAlbornoz", "date": "1656599516746", "content": "Interesting @sophchoe.\nI just asked because often we choose datasets without any specific reasoning behind it and we fall into the error of thinking that because it worked for one dataset is must work for others too, which is usually not the case.\nIt reminded me of this blog 1 by Maria Schuld where she motivates you to think about the benchmark you’re using.\nI think you have an interesting reasoning to use MNIST but it’s worth reading Maria’s blog to get a different view on benchmarks too!", "link": "https://discuss.pennylane.ai//t/implementing-specific-matrices/1995/11"}, "11": {"author": "sophchoe", "date": "1656602793181", "content": "Great blog!\nTo analyze validity of quantum machine learning circuits as opposed classical methods, we must first build quantum circuits implementing classical machine learning algorithms.\nThere are qubit-based implementation examples of quantum classifiers, but they are limited to\n\nbinary classification\nfeatures of length less than 50.\n\nI am focusing on building quantum machine learning circuits for image datasets where their features are around 1,000. How would they encode these features in the qubit model? I don’t see how with the current technology.\nGoogle’s implementation of MNIST is reducing the 28 x 28 image matrices to 4 x 4 binary matrices.\n\ngoogle1112×435 96.3 KB\n\nIBM’s implementation of MNIST is composed only of a data encoding circuit (single Ry gate).\n\nWithout being able to encode data in quantum states, there won’t be a meaningful discussion about the performance of a quantum algorithm. I am exploring different ways of encoding image data samples to quantum states.", "link": "https://discuss.pennylane.ai//t/implementing-specific-matrices/1995/12"}, "12": {"author": "CatalinaAlbornoz", "date": "1656614490193", "content": "Very interesting indeed @sophchoe! Thank you for sharing this.", "link": "https://discuss.pennylane.ai//t/implementing-specific-matrices/1995/13"}, "13": {"author": "sophchoe", "date": "1656618716802", "content": "@CatalinaAlbornoz\nThere are several papers by Maria Schulz about the importance of quantum data encoding. It is my observation that the CV model offers a richer array of data encoding schemes than the qubit-based model.\nThe limitation of the qubit-based quantum computing is that all the gates are unitary. The composition of unitary matrices is a single unitary matrix.\nThe CV model offers unitary gates, displacement gate, and nonlinear gates in a greater number than in the qubit-based model, offering much more parameters. That enables the data encoding circuit to encode a greater number of features from data.\nI am observing some promising results.\nI think the CV model is better suited for machine learning, where the features of data are continuous in nature. The qubit-based model is better suited for logic synthesis where the variables are discrete in nature.", "link": "https://discuss.pennylane.ai//t/implementing-specific-matrices/1995/14"}, "14": {"author": "CatalinaAlbornoz", "date": "1656636265612", "content": "That’s very interesting @sophchoe.\nIn our Blueprint for a Scalable Photonic Fault-Tolerant Quantum Computer 3 (video here 1) we aim towards building qubits from GKP states, so in the end we will work with the qubit model.\nI imagine you will still be able to work on the CV regime at low level though, and maybe promising CV results can motivate stronger efforts in that direction. So be sure to share your results with us when you have them!2 Replies", "link": "https://discuss.pennylane.ai//t/implementing-specific-matrices/1995/15"}, "15": {"author": "sophchoe", "date": "1656637019929", "content": "@CatalinaAlbornoz\nI will be sad when you go fully qubit-based since I see so much benefit of the CV model. However, your existing X8 still has so much potential that has not been tapped into if only for theoretical purposes.\nThank you for the paper.", "link": "https://discuss.pennylane.ai//t/implementing-specific-matrices/1995/16"}, "16": {"author": "sophchoe", "date": "1656686021333", "content": "@CatalinaAlbornoz\nThis diagram captures the idea of some of the problems that can be solved in the CV model than in the qubit-based model.\n\n06%20AM1264×514 70.4 KB\n", "link": "https://discuss.pennylane.ai//t/implementing-specific-matrices/1995/17"}, "17": {"author": "CatalinaAlbornoz", "date": "1656969599055", "content": "Yes, it is definitely an interesting area to explore @sophchoe!\nI think that if you look at the big picture though, same as happened with classical computing, most applications will be tackled better with the discrete variable model while some specific ones will work better with the continuous model.\nWe’re still in the early days of quantum computing so we never know for sure how things are going to evolve, but it’s still important to think of applications with both models.", "link": "https://discuss.pennylane.ai//t/implementing-specific-matrices/1995/18"}, "18": {"author": "sophchoe", "date": "1656972898258", "content": "@CatalinaAlbornoz absolutely!!! So many Boolean logic problems can be translated to the qubit-based model and perform beautifully.\nFor data with continuous variable feature values, the CV model seems to be a better option.1", "link": "https://discuss.pennylane.ai//t/implementing-specific-matrices/1995/19"}, "19": {"author": "sophchoe", "date": "1656686021333", "content": "@CatalinaAlbornoz\nThis diagram captures the idea of some of the problems that can be solved in the CV model than in the qubit-based model.\n\n06%20AM1264×514 70.4 KB\n", "link": "https://discuss.pennylane.ai//t/implementing-specific-matrices/1995/20"}}