{"0": {"author": "quirkyMouse", "date": "1661832437196", "content": "Dear all,\nCan anyone please explain to me, why the circuit use certain quantum gates (RX, ROT, and CZ)?\nLike why should i use those gates and not the other gates?", "link": "https://discuss.pennylane.ai//t/ensemble-classification-with-forest-and-qiskit-devices-quantum-circuit/2118/1"}, "1": {"author": "CatalinaAlbornoz", "date": "1661878751195", "content": "Hi @quirkyMouse, welcome to the forum!\nUsing an RX gate is an easy way to encode your features (input data), specially if such data is in the 0-2pi range. These features, denoted with ‘x’, are very different to our training parameters ‘theta’.\nAfter the RX gates, which embed 1 your input data into the circuit, you will need an ansatz. This ansatz is your circuit architecture, or a set of gates which - if used with the right parameters - should model your data well. Your ansatz should be complex enough to be able to represent the complexities in your underlying data, but it shouldn’t be so complex that it results in excessive running time or overfitting.\nChoosing a series of generalized rotations (3 parameters per gate) and CZ gates (no parameters per gate) is a simple way to add complexity. For very complex models you could even add additional layers with a similar architecture, or try different ansatze.\nI hope this helps answer your question!", "link": "https://discuss.pennylane.ai//t/ensemble-classification-with-forest-and-qiskit-devices-quantum-circuit/2118/2"}, "2": {"author": "quirkyMouse", "date": "1662477513699", "content": "Okay, so the data is in the 0-2 pi range, is it when we execute this line of code?\nx = 2 * np.pi * (x - x_min) / (x_max - x_min) - np.pi\nAnd can you  @CatalinaAlbornoz or anyone  please explain to me where is this formula come from also what is this formula used for?\nI’m really new to this quantum computing thing so i’m gonna ask a lot of question in the future so please be patient with me ", "link": "https://discuss.pennylane.ai//t/ensemble-classification-with-forest-and-qiskit-devices-quantum-circuit/2118/3"}, "3": {"author": "CatalinaAlbornoz", "date": "1662507008315", "content": "Hi @quirkyMouse, it’s great that you’re asking questions!\nThat line of code is effectively putting all of your data into the range [-pi , pi], which is also perfectly ok. It’s basically equivalent.\nThis formula allows you to normalize your data and then shift it to the desired range. I would recommend that you study the Xanadu Quantum Codebook, specifically the introduction module, to keep learning the basics.\nI hope this is helpful!", "link": "https://discuss.pennylane.ai//t/ensemble-classification-with-forest-and-qiskit-devices-quantum-circuit/2118/4"}, "4": {"author": "Ganesh_Chockalingam", "date": "1668162712524", "content": "Hello. I’m using quantum circuits using pennylane to build neural networks. The problem is when I use default qubits from pennylane, the NN training is fast. But when I use ibmq simulator as device, the training is very slow. Can you help me understand why it is happening like this? I want to know if the same effect will happen when I use ibmq hardware as well.", "link": "https://discuss.pennylane.ai//t/ensemble-classification-with-forest-and-qiskit-devices-quantum-circuit/2118/5"}, "5": {"author": "CatalinaAlbornoz", "date": "1668216480723", "content": "Hi @Ganesh_Chockalingam, welcome to the Forum!\nAs I mentioned in the other topic we’re looking into the issue. Some slowdown is normal but the warning you’re getting is strange so we’re looking into the problem to see if we can find a cause. We will keep you updated of anything we find.", "link": "https://discuss.pennylane.ai//t/ensemble-classification-with-forest-and-qiskit-devices-quantum-circuit/2118/6"}, "6": {"author": "quirkyMouse", "date": "1661832437196", "content": "Dear all,\nCan anyone please explain to me, why the circuit use certain quantum gates (RX, ROT, and CZ)?\nLike why should i use those gates and not the other gates?", "link": "https://discuss.pennylane.ai//t/ensemble-classification-with-forest-and-qiskit-devices-quantum-circuit/2118/7"}}