{"0": {"author": "Muhammad_Kashif", "date": "1668436822611", "content": "Hello,\nI have a query regarding cost function globality and locality which I recently come across in this paper 2, and are definded below.\nGlobal Cost Function:\n\nimage859×77 25.5 KB\n\nLocal Cost Function:\n\nimage881×109 26.5 KB\n\nMy question is how is it applicable in HQNNs (built in pennylane) where a cost function from classical machine learning library (keras) is defined, for instance cross_entropy .\nThe HQNN working (I have used) is as follows:\n input --> Data encoding --> quantum circuit with measurements--> classical neuron layer  --> output\nHow can the cross_entropy cost function be combined with the global and local cost function definitions, defined above?\nAs per my understanding the global cost function means measure all qubits in an n-qubit system where as local cost function means measuring single qubit in  an n-qubit system. In that case the above equations for both global and local cost function are just the representation of all and single qubit measurement respectively, right? I mean just representing the output of quantum circuit?\nAny help would be appreciated. Thanks", "link": "https://discuss.pennylane.ai//t/cost-function-in-hqnn/2291/1"}, "1": {"author": "CatalinaAlbornoz", "date": "1668549133104", "content": "Hi @Muhammad_Kashif,\nWe’re looking into your question and will come back soon with an answer!\nYou got us thinking here ", "link": "https://discuss.pennylane.ai//t/cost-function-in-hqnn/2291/2"}, "2": {"author": "Muhammad_Kashif", "date": "1668586888808", "content": "Hi @CatalinaAlbornoz,\nThanks for the response and looking into my query.\nI will eagerly waiting to hear back from you soon.\nThanks again…!", "link": "https://discuss.pennylane.ai//t/cost-function-in-hqnn/2291/3"}, "3": {"author": "Korbinian_Kottmann", "date": "1668675585417", "content": "Hi @Muhammad_Kashif,\nI dont know too much about hybrid qnns, but the result about barren plateau only concerns the quantum part of your neural network. The cross_entropy in the end does not need to be made local as far as I know.\nHowever, you need to be careful what output measurements you are outputting from the qnn layer. The paper you are citing basically states that\na) the cost function needs to be local, i.e. you need to output measurements of local observerbales (e.g. return [qml.expval(op) for op in local_ops] in your qnode where local_ops are for example Pauli strings acting on few qubits).\nb) The QNN needs to be shallow, where shallowness is here defined as the depth being logarithmic in the number of qubits (but this is more a scaling argument, you are most likely looking at a fixed system size?).\nLet me know if that helps.", "link": "https://discuss.pennylane.ai//t/cost-function-in-hqnn/2291/4"}, "4": {"author": "Muhammad_Kashif", "date": "1668712440384", "content": "Hi @Korbinian_Kottmann,\nThanks for your input.\nRegarding the paper I cited;\nActually my understanding of global and local cost function definitions in equations mentioned in my original post is the same, i.e., local cost function essentially entails measuring single (or few) qubits in a multi-qubit QNN whereas global cost function means measuring all the qubits in the underlying QNN. I actually wanted to confirm if my understanding is correct?\nI agree that issue of BP is related to quantum part only. However, in HQNNs there is some classical influence (classical neurons layers) as well, where we can define (classical) cost function and possibly other parameters from classical ML.\nIn my query, the cost function (cross_entropy) will be governing the optimization rules of HQNN irrespective of global/local measurement of preceding QNN and these global/local cost function of QNNs just represent the output form of QNN which is then processed by the following classical layer in HQNNs, right?\nRegarding the depth I am actually trying and experimenting with different widths and depths of quantum layers in HQNNs rather than a fixed size to see how are global and local cost function definitions (in quantum part) play the role.\nAny further input would be appreciated. Many thanks.", "link": "https://discuss.pennylane.ai//t/cost-function-in-hqnn/2291/5"}, "5": {"author": "Korbinian_Kottmann", "date": "1668776855349", "content": "My understanding is that also in the local cost function you can measure all qubits, its just that each expectation value is a local observable. Take e.g. H_\\text{local} = \\sum_i X_i as an example of local observable that involves all qubits. In that case you would pass e.g. each individual term <X_i> from your qnn layer to whatever comes after.\nHope that helps!", "link": "https://discuss.pennylane.ai//t/cost-function-in-hqnn/2291/6"}, "6": {"author": "Muhammad_Kashif", "date": "1668869874550", "content": "Hi @Korbinian_Kottmann,\ngot it… thanks… However, strictly being in the scope of the paper I cited, didn’t the authors mean single qubit measurement in a multi-qubit systems when referring to a local cost function and all-qubit measurement in global cost function.\nThanks", "link": "https://discuss.pennylane.ai//t/cost-function-in-hqnn/2291/7"}, "7": {"author": "Korbinian_Kottmann", "date": "1669108461934", "content": "In the example of a local cost function that you cite above, the observable is a sum over single qubit operators, all acting on different qubits. So it is not a single qubit measurement, but rather a sum over single qubit measurements.\nIndeed the notion can be a bit confusing. You are still measuring all qubits. The difference is that in one case a true global observable is measured, whereas in the local case only local observables are measured.\nFYI it doesnt even have to be single qubit measurements, it can also be m-body terms, as long as m is relatively small. More details are in the paper around equation (10) and (16).", "link": "https://discuss.pennylane.ai//t/cost-function-in-hqnn/2291/8"}, "8": {"author": "Muhammad_Kashif", "date": "1668436822611", "content": "Hello,\nI have a query regarding cost function globality and locality which I recently come across in this paper 2, and are definded below.\nGlobal Cost Function:\n\nimage859×77 25.5 KB\n\nLocal Cost Function:\n\nimage881×109 26.5 KB\n\nMy question is how is it applicable in HQNNs (built in pennylane) where a cost function from classical machine learning library (keras) is defined, for instance cross_entropy .\nThe HQNN working (I have used) is as follows:\n input --> Data encoding --> quantum circuit with measurements--> classical neuron layer  --> output\nHow can the cross_entropy cost function be combined with the global and local cost function definitions, defined above?\nAs per my understanding the global cost function means measure all qubits in an n-qubit system where as local cost function means measuring single qubit in  an n-qubit system. In that case the above equations for both global and local cost function are just the representation of all and single qubit measurement respectively, right? I mean just representing the output of quantum circuit?\nAny help would be appreciated. Thanks", "link": "https://discuss.pennylane.ai//t/cost-function-in-hqnn/2291/9"}, "9": {"author": "Korbinian_Kottmann", "date": "1668776855349", "content": "My understanding is that also in the local cost function you can measure all qubits, its just that each expectation value is a local observable. Take e.g. H_\\text{local} = \\sum_i X_iHlocal=∑iXi as an example of local observable that involves all qubits. In that case you would pass e.g. each individual term <X_i><Xi> from your qnn layer to whatever comes after.\nHope that helps!", "link": "https://discuss.pennylane.ai//t/cost-function-in-hqnn/2291/10"}}