{"0": {"author": "Jack_Hausmann", "date": "1681658644001", "content": "Hello,\nhow many physical qubits do you use for a logical qubit and can you say how many physical qubits your quantum computer would need to have in order to be universally usable and approximately how long it takes to build such a quantum computer?", "link": "https://discuss.pennylane.ai//t/quantum-advantage/2843/1"}, "1": {"author": "isaacdevlugt", "date": "1681741897066", "content": "Hey @Jack_Hausmann! When you say “how many physical qubits do you use for a logical qubit”, are you referring to Borealis? If so, Borealis demonstrated quantum computational advantage with 216 qubits.\nThe next half of your question is a pretty hard one to answer! There’s reasonable consensus in the community that a 1 million qubit, fault-tolerant device is needed. How long will that take? I guess you’ll have to wait and see ", "link": "https://discuss.pennylane.ai//t/quantum-advantage/2843/2"}, "2": {"author": "Jack_Hausmann", "date": "1681768950468", "content": "So do you mean that a physical qubit corresponds to a logical qubit?", "link": "https://discuss.pennylane.ai//t/quantum-advantage/2843/3"}, "3": {"author": "isaacdevlugt", "date": "1681824905850", "content": "The device itself — Borealis — in the experiment that was run used 216 physical qubits . A logical qubit is made up of several physical qubits that effectively behave like a single physical qubit for all intents and purposes.", "link": "https://discuss.pennylane.ai//t/quantum-advantage/2843/4"}, "4": {"author": "Jack_Hausmann", "date": "1681826030830", "content": "Yes, but there is no fixed value of how many physical qubits a logical qubit consists of, that’s why I ask how many there are in your case.", "link": "https://discuss.pennylane.ai//t/quantum-advantage/2843/5"}, "5": {"author": "isaacdevlugt", "date": "1681826506766", "content": "Oh, I see! Well, the experiment Borealis ran was just 216 physical qubits .", "link": "https://discuss.pennylane.ai//t/quantum-advantage/2843/6"}, "6": {"author": "Jack_Hausmann", "date": "1681827474959", "content": "Ah, now I think I understand you. You do not use this technology to connect several physical qubits to one logical qubit. Am I right?", "link": "https://discuss.pennylane.ai//t/quantum-advantage/2843/7"}, "7": {"author": "isaacdevlugt", "date": "1681828399678", "content": "For the experiment that Borealis can run (gaussian boson sampling), that’s correct .", "link": "https://discuss.pennylane.ai//t/quantum-advantage/2843/8"}, "8": {"author": "Jack_Hausmann", "date": "1681828466720", "content": "But how does that happen? Is it related to the fact that it is a photonic quantum computer and therefore does not need this technology?", "link": "https://discuss.pennylane.ai//t/quantum-advantage/2843/9"}, "9": {"author": "isaacdevlugt", "date": "1681830177135", "content": "Logical qubits are really only defined in the context of what the device is trying to do (e.g., a quantum algorithm or error-correction protocol). So, it’s not that a device “has” logical qubits, per se. A quantum device has physical qubits that can function as logical qubits for the purposes of the task it’s programmed to perform.\nLogical qubits are useful entities in error-correcting protocols in that they hinge on redundancy as a defence mechanism for qubit decoherence. The downside here is that we need more qubits to do this! With the technology that underpins Borealis, though, there are more modest overheads in comparison to other technologies when encoding error-corrected logical qubits into physical qubits because of its architecture. You can read more about it here 1.\nThere are some subtleties and nuances here, but I hope that this helps!", "link": "https://discuss.pennylane.ai//t/quantum-advantage/2843/10"}, "10": {"author": "Jack_Hausmann", "date": "1681658644001", "content": "Hello,\nhow many physical qubits do you use for a logical qubit and can you say how many physical qubits your quantum computer would need to have in order to be universally usable and approximately how long it takes to build such a quantum computer?", "link": "https://discuss.pennylane.ai//t/quantum-advantage/2843/11"}}